###########################
# ベースイメージのインストール
###########################
FROM ubuntu:latest

########################################################################
# RUN命令でコンテナ内にrsyslogエージェントなどの必要エージェントをインストール
########################################################################
# rsyslogのインストール
RUN apt-get update
RUN apt-get install -y -q rsyslog
# ダウンロードしたパッケージ(ライブラリ)のキャッシュを削除する。Dockerイメージのサイズ削減のため。
RUN apt-get clean
# apt-get updateで取得したパッケージ(ライブラリ)の一覧リストを削除する。これもイメージサイズ削減のため。
RUN rm -rf /var/lib/apt/lists/*

##################################################
# COPY命令でホスト側のconfigファイルをサーバ側にコピー
##################################################
COPY ./rsyslog.conf /etc/rsyslog.conf

############################
# rsyslog(rsyslogd)を起動する
############################
CMD [ "rsyslogd", "-n" ]

